release: Tidely v1.4.0
